Белгипрозем_2017/src/Documents/мРасчетЗарплаты/мРасчетЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мРасчетЗарплаты</name>
  <registerRecords>AccumulationRegister.НачисленаЗП</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СреднесписочнаяЧисленность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписал1</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписал2</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписал3</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписал4</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкладПлановый</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасовПоФакту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкладЗаФОВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкладПоФакту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазаПремииЗаРуководство</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремииЗаРуководство</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияЗаРуководство</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПовышенияПонижения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПовышенияПонижения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияИтоговая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ТабельныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовоеНачисление</name>
      <comment>Сумма сделки без учета +/- коэф.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазоваяПремия</name>
      <comment>Базовое начисление - Оклад по факту</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/AccumulationRegisters/НачисленаЗП/НачисленаЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НачисленаЗП</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНачисления</name>
    <type>
      <types>CatalogRef.мВидыНачислений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.мВидыЭкономическойДеятельности</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Белгипрозем_2017/src/Enums/мТипыНачислений/мТипыНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>мТипыНачислений</name>
  <enumValues>
    <name>Доплата</name>
  </enumValues>
  <enumValues>
    <name>Премия</name>
  </enumValues>
  <enumValues>
    <name>Оклад</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Documents/мРасчетЗарплаты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.мРасчетЗарплаты.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ВыполнитьПроведение(ДополнительныеСвойства, Движения, Отказ);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
КонецПроцедуры

Процедура ВыполнитьПроведение(ДополнительныеСвойства, Движения, Отказ) 

	ДанныеДокумента = ДополнительныеСвойства.ТаблицыДляДвижений.ДанныеДокумента;
	НачисленоПоВД = ДополнительныеСвойства.ТаблицыДляДвижений.НачисленоПоВидамДеятельности;
	
	Если Отказ ИЛИ ДанныеДокумента.Количество() = 0 ИЛИ НачисленоПоВД.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Таблица = СоздатьТЗ();
	ВидыНачислений = ПолучитьВидыНачислений();
	ВидНачОклад = ВидыНачислений.Оклад;
	
	Для каждого Стр Из ДанныеДокумента Цикл
		ПараметрыРаспределения = Новый Структура();
		ПараметрыРаспределения.Вставить("ТабДвиж", Таблица);
		ПараметрыРаспределения.Вставить("СтрокаДок", Стр);
		ПараметрыРаспределения.Вставить("ТабИсходная", НачисленоПоВД);
		
		Если Стр.ПроцентПремииЗаРуководство > 0 Тогда
			// Это начальник
		    ВидНач = ВидыНачислений.Премия;
			ПараметрыРаспределения.Вставить("ЭтоНачальник", Истина);
		Иначе
			// Это исполнитель
		    ВидНач = ВидыНачислений.Доплата;
			ПараметрыРаспределения.Вставить("ЭтоНачальник", Ложь);
		КонецЕсли;
		
		// сначала распределяем оклад
		ПараметрыРаспределения.Вставить("СуммаОбщая", Стр.ОкладПоФакту);
		ПараметрыРаспределения.Вставить("ВидНач", ВидНачОклад);
		
		Распределить(ПараметрыРаспределения);
		
		// распределение премии
		Если Стр.ПремияИтоговая > 0 Тогда
			ПараметрыРаспределения.Вставить("СуммаОбщая", Стр.ПремияИтоговая);
			ПараметрыРаспределения.Вставить("ВидНач", ВидНач);
			Распределить(ПараметрыРаспределения);
		КонецЕсли;
	КонецЦикла; 

	Движения.НачисленаЗП.Записывать = Истина;
	Движения.НачисленаЗП.Загрузить(Таблица);
	
КонецПроцедуры

// Распределяет сумму по видам деятельности
// для исполнителей распределение начисленных сумм происходит пропорционально
//  начисленной ЗП по видам деятельности
// для начальников - пропорционально начисленной ЗП исполнителям из их 
//  подразделения по видам деятельности 
Функция Распределить(ПараметрыРаспределения)
	
	СуммаОбщая = ПараметрыРаспределения.СуммаОбщая;
	СтрДок = ПараметрыРаспределения.СтрокаДок;
	Таблица = ПараметрыРаспределения.ТабДвиж;
	ВидНач = ПараметрыРаспределения.ВидНач;
	НачисленоПоВД = ПараметрыРаспределения.ТабИсходная;
	ЭтоНачальник = ПараметрыРаспределения.ЭтоНачальник;
	
	Остаток = СуммаОбщая;
	Если СуммаОбщая = 0 Тогда
		// нечего распределять
		Возврат 0;
	КонецЕсли;
	
	Если ЭтоНачальник Тогда
		Отбор = Новый Структура("Подразделение", СтрДок.Подразделение);
	Иначе
		Отбор = Новый Структура("Исполнитель", СтрДок.Пользователь);
	КонецЕсли; 
	
	ИскСтроки = НачисленоПоВД.НайтиСтроки(Отбор);
	Если ИскСтроки.Количество() = 0 Тогда
		// ничего не начислено                                        
	Иначе
		
		// для накопления Начислено в разрезе видов деятельности
		ТзНач = Новый ТаблицаЗначений;
		ТзНач.Колонки.Добавить("ВидДеятельности");
		ТзНач.Колонки.Добавить("Начислено");
		
		Для й=0 По ИскСтроки.Количество()-1 Цикл
			НовСтр = ТзНач.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ИскСтроки[й]) 
		КонецЦикла;
		
		ТзНач.Свернуть("ВидДеятельности", "Начислено");
		ВсегоНач = ТзНач.Итог("Начислено");
		
		Для й=0 По ТзНач.Количество()-1 Цикл
			Если й < ТзНач.Количество()-1 Тогда
				// пропорционально
				СуммаНач = Окр(СуммаОбщая/ВсегоНач*ТзНач[й].Начислено, 2);
			Иначе	
				// остаток
			    СуммаНач = Остаток;
			КонецЕсли; 

			СтрТаб = Таблица.Добавить();
			СтрТаб.Период = НачалоМесяца(СтрДок.Период);
			СтрТаб.Подразделение = СтрДок.Подразделение;
			СтрТаб.Исполнитель = СтрДок.Пользователь;
			СтрТаб.ВидНачисления = ВидНач;
			СтрТаб.ВидДеятельности = ТзНач[й].ВидДеятельности;
			СтрТаб.Сумма = СуммаНач;
			СтрТаб.Часы = СтрДок.ЧасовПоФакту;
			
			Остаток = Остаток - СуммаНач;
			Если Остаток <= 0 Тогда
				Прервать;
			КонецЕсли; 
		КонецЦикла; 	
	КонецЕсли; 
	
	Возврат 0;
КонецФункции 

Функция СоздатьТЗ()

	ТЗ = новый ТаблицаЗначений;
	Тз.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	Тз.Колонки.Добавить("Исполнитель", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	Тз.Колонки.Добавить("ВидНачисления", Новый ОписаниеТипов("СправочникСсылка.мВидыНачислений"));
	Тз.Колонки.Добавить("ВидДеятельности", Новый ОписаниеТипов("СправочникСсылка.мВидыЭкономическойДеятельности"));
	Тз.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Тз.Колонки.Добавить("Часы", Новый ОписаниеТипов("Число"));
	Тз.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	
	Возврат ТЗ;

КонецФункции 

Функция ПолучитьВидыНачислений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мВидыНачислений.Ссылка КАК ВидНачисления,
		|	мВидыНачислений.ТипНачисления
		|ИЗ
		|	Справочник.мВидыНачислений КАК мВидыНачислений
		|ГДЕ
		|	НЕ мВидыНачислений.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СтруктураНачислений = Новый Структура(); 
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипНачисления = Перечисления.мТипыНачислений.Оклад Тогда
			СтруктураНачислений.Вставить("Оклад", Выборка.ВидНачисления);
		ИначеЕсли Выборка.ТипНачисления = Перечисления.мТипыНачислений.Доплата Тогда
			СтруктураНачислений.Вставить("Доплата", Выборка.ВидНачисления);	
		ИначеЕсли Выборка.ТипНачисления = Перечисления.мТипыНачислений.Премия Тогда
			СтруктураНачислений.Вставить("Премия", Выборка.ВидНачисления);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураНачислений;

КонецФункции 

Процедура ОбработкаУдаленияПроведения(Отказ)
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ПроведениеСервер.УстановитьРежимПроведения(Проведен, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
КонецПроцедуры
